{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[]},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["**Васюков Л.В. ДЗ № 1**"],"metadata":{"id":"-DIi23HOFq_c"}},{"cell_type":"markdown","source":["**Задание 1**\n","Пользователь вводит число.Напишите программу,которая выводит сообщение, является это число положительным,отрицательным или нулем."],"metadata":{"id":"TVXYA60kFm89"}},{"cell_type":"code","execution_count":null,"metadata":{"id":"lYy7PgnyE7R1"},"outputs":[],"source":["i = int(input())\n","if i > 0:\n","    print(i,': положительное число')\n","elif i < 0:\n","    print(i,': отрицательное число')\n","else:\n","    print('Число:',i)"]},{"cell_type":"markdown","source":["**Задание 2**\n","Пользователь вводит число от 1 до 9. Вывести таблицу умножения на это число."],"metadata":{"id":"MYWQoiPaFs0d"}},{"cell_type":"code","source":["c = int(input())\n","d = 0\n","for i in range(1,10):\n","  d = c * i\n","  print(c, '*', i, '=',d)\n","  d = 0"],"metadata":{"id":"mUzKeFS5FsUd"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["**Задание 3**\n","Напишите программу,которая анализирует ежедневные расходы за неделю.Пользователь вводит суммы,потраченные в каждый день недели,а программа определяет самый дорогой и самый дешевый дни,а также среднюю сумму расходов за *неделю*."],"metadata":{"id":"GUXOsrSSHReN"}},{"cell_type":"code","source":["# необходимо ввести информацию по тратам за каждый из 7 дней.\n","import ast\n","i = 7 # исходное количество дней недели\n","c = dict()\n","for _ in range (i): # цикл для ввода данных за каждый день\n","  day = input('Введите день недели: ') # для ввода дней использовать: понедельник, вторник, среда, четверг, пятница, суббота, воскресенье.\n","  pay = float(input('Введите сумму: ')) # ввод значений с плавающей точкой. Если траты не было, то поставить 0.\n","  # проверка на ввод числового значения\n","  try:\n","    float(pay)\n","  except ValueError:\n","    print(\"Ошибка! Введите числовое значение.\")\n","    continue\n","  else:\n","    # если ошибок не возникло, продолжаем выполнение кода\n","    pass\n","  c[day]= pay # запись в словарь\n","fl = list(c.values()) # выбор всех значений из словаря\n","if sum(fl) == 0: # проверка на отсутствие трат\n","  print('Траты отсутвуют')\n","else:\n","  max_values = max(fl) # максимальное значение из словаря\n","  mx_fn = {k:v for k, v in c.items() if v == max_values} # создание нового словаря с ключем и значением, соответсвующим ключу и значению из основного словаря, если значение равно максимальному значению из основного\n","  fil2 = filter(lambda x: x != 0, fl) # отсеивание значений равных 0\n","  min_values = min(list(fil2)) # минимальное значение из словаря\n","  mn_fn = {l:m for l, m in c.items() if m == min_values} # создание нового словаря с ключем и значением, соответсвующим ключу и значению из основного словаря, если значение равно минимальному значению из основного\n","  fil2 = filter(lambda x: x != 0, fl) # отсеивание значений равных 0\n","  if mx_fn == mn_fn: # проверка на совпадения сумм за разные дни или на наличие траты только за один день\n","    print('Сумма трат за разные дни совпадает, либо была внесена трата только за один день. Сумма потрачена в:',list(mx_fn.keys()))\n","    print('Среднее значение всех трат за неделю: ', format(sum(c.values())/(len(c)),'.2f'))\n","  else: # вывод дней с максимальными и минимальными тратами и среднего за неделю\n","    print('Максимальная сумма была потрачена в:',list(mx_fn.keys()))\n","    print('Минимальная сумма была потрачена в:',list(mn_fn.keys()))\n","    print('Среднее значение всех трат за неделю:',format(sum(c.values())/(len(c)),'.2f'))"],"metadata":{"id":"YUIrcpD0UGNr"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["**Задание 4**\n","Напишите программу-игру, в которой компьютер загадывает число от 1 до 100,а пользователь пытается его угадать. После каждой попытки программа должна сообщать, больше или меньше загаданное число, чем введенное пользователем.Игра продолжается до тех пор, пока число не будет угадано."],"metadata":{"id":"PP11dpHVXENi"}},{"cell_type":"code","source":["import random\n","i = random.randint(1,100)\n","c = int(input('Введите число от 1 до 100: '))\n","while c != i:\n","  if c > i:\n","    print('Загаданное число меньше.')\n","  elif c < i:\n","    print('Загаданное число больше.')\n","  c = int(input('Введите число: '))\n","if c == i:\n","    print('Победа! Было загадано число',i, 'и Вы его отгадали.')"],"metadata":{"id":"9DWlYx8HXGvy"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["**Задание 5**\n","Дан массив целых чисел nums, найдите непрерывный подмассив,содержащий хотя бы одно число, который имеет наибольшую сумму, и верните эту сумму."],"metadata":{"id":"NKkldRZzr7Ba"}},{"cell_type":"code","source":["# Для проверки на случайных числах убрать знак # и закомментировать массив [-2,1,-3,4,-1,2,1,-5,-4]\n","# from random import randint\n","# i = int(input())\n","# nums = [randint(-10,11) for _ in range(i)]\n","nums = [-2,1,-3,4,-1,2,1,-5,-4]\n","c = len(nums)+1\n","mx_sum = sum(nums)\n","mx_podm = nums\n","for n in range(c):\n","  for m in range(c):\n","    if m <= n:\n","        continue\n","    pr = sum(nums[n:m])\n","    if pr > mx_sum:\n","      mx_podm = nums[n:m]\n","      mx_sum = sum(mx_podm)\n","print('Непрерывным подмассивом массива', nums, 'c максимальной суммой',mx_sum, 'является', mx_podm)"],"metadata":{"id":"fNRDOIVer-kB"},"execution_count":null,"outputs":[]}]}